In [1]:
import numpy as np
import pandas as pd

from datetime import datetime

In [2]:
myyear =  1995
mymonth = 10
myday = 30
myhour = 7
mymin = 5
mysec = 10

In [3]:
mydate = datetime(myyear,mymonth,myday)

In [4]:
mydate

datetime.datetime(1995, 10, 30, 0, 0)

In [5]:
mydatetime = datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [6]:
mydatetime

datetime.datetime(1995, 10, 30, 7, 5, 10)

In [7]:
mydatetime.year

1995

In [8]:
myser = pd.Series(['Nov 3, 1990','2000-01-01',None])

In [9]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [10]:
timeser = pd.to_datetime(myser)

In [11]:
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [12]:
timeser[0].year

1990

In [13]:
obvio_euro_date = '31-12-2000'

In [14]:
pd.to_datetime(obvio_euro_date)

C:\Users\priya\AppData\Local\Temp\ipykernel_12184\2997623504.py:1: UserWarning: Parsing '31-12-2000' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  pd.to_datetime(obvio_euro_date)

Timestamp('2000-12-31 00:00:00')

In [15]:
euro_date = '10-12-2000'

In [16]:
pd.to_datetime(euro_date) ## American format

Timestamp('2000-10-12 00:00:00')

In [17]:
pd.to_datetime(euro_date,dayfirst=True) #European format

Timestamp('2000-12-10 00:00:00')

In [18]:
style_date = '12--Dec--2000'

In [20]:
pd.to_datetime(style_date,format = '%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [21]:
custom_date = "12th of Dec 2000"

In [22]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [23]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [25]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [26]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [27]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [28]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [29]:
sales['DATE'][155].year

2004

In [31]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates = [0])

In [33]:
sales.dtypes

DATE             datetime64[ns]
MRTSSM4453USN             int64
dtype: object

In [38]:
sales = sales.set_index("DATE")

In [40]:
sales.resample(rule ='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [41]:
sale = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [42]:
sale

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [45]:
sale.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [46]:
sale['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [47]:
sale['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64

In [48]:
sale['DATE'].dt.day

0      1
1      1
2      1
3      1
4      1
      ..
335    1
336    1
337    1
338    1
339    1
Name: DATE, Length: 340, dtype: int64